In [7]:
import pandas
frame = pandas.read_csv("test_lectura.csv")
frame

  Otro    Nombre  Edad  Dia  Mes   Año   Estado
0    d    German    29    6    2  1992  Soltero
1    r     Cesar    30    3   11  1991  Soltero
2    g  Veronica    26   17    3  1994  Soltera
3    z    Andrea    34   23    4  1984  Soltera

In [15]:
from pandas import DataFrame
data_frame = DataFrame(frame,columns=['Nombre','Edad','Dia','Mes','Año','Estado'])
data_frame

     Nombre  Edad  Dia  Mes   Año   Estado
0    German    29    6    2  1992  Soltero
1     Cesar    30    3   11  1991  Soltero
2  Veronica    26   17    3  1994  Soltera
3    Andrea    34   23    4  1984  Soltera

In [16]:
data_frame = data_frame.drop([0])
data_frame

     Nombre  Edad  Dia  Mes   Año   Estado
1     Cesar    30    3   11  1991  Soltero
2  Veronica    26   17    3  1994  Soltera
3    Andrea    34   23    4  1984  Soltera

In [17]:
data_frame = data_frame.drop('Estado',axis=1)
data_frame

     Nombre  Edad  Dia  Mes   Año
1     Cesar    30    3   11  1991
2  Veronica    26   17    3  1994
3    Andrea    34   23    4  1984

In [18]:
data_frame.sort_values(by='Año')

     Nombre  Edad  Dia  Mes   Año
3    Andrea    34   23    4  1984
1     Cesar    30    3   11  1991
2  Veronica    26   17    3  1994

In [19]:
data_frame.sum(numeric_only=True)

Edad      90
Dia       43
Mes       18
Año     5969
dtype: int64